#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevopsFiapSoat3-G35/postech-fase-3-db/runs/run-eXBLe8RFiJrBXN8w

Waiting for the plan to start...

Terraform v1.7.4
on linux_amd64
Initializing plugins and modules...
data.aws_availability_zones.available: Refreshing...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-014d09ca3e3f0f8fb]
aws_db_parameter_group.education: Refreshing state... [id=education]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-00487c33de206022a]
aws_security_group.rds: Refreshing state... [id=sg-04a78db710082b129]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-02d61e135f98e213c]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01f06981c1b1dcc67]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-02df9eb2ec77f5a1a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b21768ebc88e32d2]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-00487c33de206022a1080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-038b6194c317f89b0]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ab53d823523c0ed0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fd922c272a90fd1c]
aws_db_subnet_group.education: Refreshing state... [id=education]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.education will be created
  + resource "aws_db_instance" "education" {
      + address                               = (known after apply)
      + allocated_storage                     = 5
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.11"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "education"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "education"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = true
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "education"
      + vpc_security_group_ids                = [
          + "sg-04a78db710082b129",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ rds_hostname = (sensitive value)
  ~ rds_port     = (sensitive value)
  ~ rds_username = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @alinedonatoc, Action: `pull_request`*